{
  "Calculator": "Click a type of problem (derivatives, integrals, or series) to calculate the result. The problem will be displayed in the top box and the answer will be displayed below it.\n\nDerivatives:\nEnter an expression and choose the variable from the dropdown box.\n\nIntegrals:\nEnter an expression and choose the variable form the dropdown box.\n\nSeries:\nEnter an expression, choose the variable from the dropdown box, and enter a number as the start value for the series.\n\nSpecial functions:\nType pi for pi, e for e, infty or infinity for infinity, and use ^(-1) for inverse trig functions. If something doesn't work right, try adding a space or parentheses.",
  "Flashcards": "See the flashcards in a set. To flip between the answer and problem side, click the card, or press the \"Flip Card\" button. You can go to the next or previous card in the set using the corresponding buttons. If you want to edit or delete the set, click on the \"Edit Set\" button. You can also check the \"Random Order\" box to randomize the order of the cards.",
  "FlashcardSelection": "From here, you can choose a flashcard set to practice by clicking the corresponding button. You can also create your own set by clicking a \"New Flashcard Set\" button.\n\nIf you want to see all of the flashcards for a given problem type (derivatives, integrals or series), click the corresponding \"All\" button.\n\nIf you would like to edit or remove a set, first click on the set, then click the \"Edit Set\" button. Note that you cannot edit the \"All\" sets.",
  "FlashcardSetEdit": "Edit a flashcard set. Click the \"New Item\" button to add a new card to the set. Press \"Delete Set\" to delete the set. Press the edit button on the left to edit the problem or the edit button on the right to edit the answer. A box will pop up where you can enter the desired expression. To remove a card, press the \"Remove\" button.\n\nSpecial functions:\nType pi for pi, e for e, infty or infinity for infinity, and use ^(-1) for inverse trig functions.\nTo type a derivative, use d/dx (f(x)). For integrals, do int f(x) or int_a^b f(x) for an integral with limits. For series, do sum_(n=0)^infty f(x). For limits, use lim_(xtoinfty)\n\nIf you want to enter plain text instead of math, place a single $ at the start of the expression.\n\nIf something doesn't work right, try adding a space or parentheses.",
  "Graph": "Here, you can graph a function. Enter the function, and its graph will appear in the box. Additionally, you can check the boxes for zeroes, extrema, inflection points, derivative, and integral to see the corresponding features of the graph. You can also click the \"Set Window\" button to change the bounds of the graph. Enter the new bounds in the box in the form: xmin,xmax,ymin,ymax\n\nSpecial functions:\nType pi for pi, e for e, infty or infinity for infinity, and use ^(-1) for inverse trig functions. If something doesn't work right, try adding a space or parentheses.",
  "Problem": "Test your math skills with computer-generated problems. The problem appears in the top box. Enter your answer in the text box and an image of your input will appear below the problem.\n\nTo get a new problem, press the \"New\" button to the left of the text entry box, or in the box that pops up when you get an answer correct.\n\nTo check your answer, press the \"Check\" button. A box will pop up telling you how you did. If you got it correct, you can press the \"New\" button to get a new problem. If you got it incorrect, you can press the \"Answer\" button to get the answer. If you had an input error, make sure to check your input and try again.\n\nSpecial functions:\nType pi for pi, e for e, and use ^(-1) for inverse trig functions. If something doesn't work right, try adding a space or parentheses.\n\nPlease note that these problems are computer-generated and computers simply lack the intuition humans do. It is possible that your answer will be marked as incorrect even if it's not.",
  "ProblemSelection": "Decide which type or problem you want to try, check the boxes for the techniques you want to use, choose a complexity (for derivatives and integrals) and press \"Go\" to test yourself with some math problems.\n\nA note on complexity:\nComplexity increases very quickly, and is therefore limited to 5 for derivatives and 3 for integrals. The defaults of 3 and 2 are the recommended complexities, but feel free to take things easy or to challenge yourself.",
  "ProblemSeries": "Test your math skills with computer-generated problems. The problem appears in the box. Click the button that corresponds with whether the series converges or diverges.\n\nTo get a new problem, press the \"New\" button.\n\nTo check your answer, press the \"Check\" button. A box will pop up telling you how you did. If you got it correct, you can press the \"New\" button to get a new problem.\n\nPlease note that these problems are computer-generated and computers simply lack the intuition humans do. It is possible that your answer will be marked as incorrect even if it's not."
}